Can't edit workset ' [Name] '.
  Namespace:   Autodesk.Revit.DB
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
 Syntax
  C#
public static FailureDefinitionId CannotEditRenamedWorkset { get; }
  Visual Basic
Public Shared ReadOnly Property CannotEditRenamedWorkset As FailureDefinitionId
	Get
  Visual C++
public:
static property FailureDefinitionId^ CannotEditRenamedWorkset {
	FailureDefinitionId^ get ();
}
 See Also
  BuiltInFailures EditingFailures Class
  Autodesk.Revit.DB Namespace